api/app/controllers/wishlists_controller.rb

  def show
    user = User.find(params[:user_id])
    wishlist = Wishlist.find(params[:id])
    liked_places_ids = wishlist.places_wishlists.where(liked: true).pluck(:place_id)
    liked_places = Place.find(liked_places_ids)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "wishlists".* FROM "wishlists" WHERE "wishlists"."id" = $1 LIMIT 1  [["id", nil]]
SELECT "places_wishlists"."place_id" FROM "places_wishlists" WHERE "places_wishlists"."wishlist_id" = $1 AND "places_wishlists"."liked" = $2  [["wishlist_id", 1], ["liked", "t"]]
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", 1]]